// Реализовать калькулятор, в котором есть слайдер (input type=”range”) и
// поле ввода (input type=”number”). Изменяя состояние range меняется состояние поля ввода number. И наоборот.
// Реализовать шкалу, которая в пикселях будет отображать значение range.
// Например - range выбрали число 83, высота шкалы будет 83 пикселя.
// Уровень 0 - 50 (включительно) - должен иметь зеленый цвет. От 50 до 75(включительно) -
// желтый. От 75 - 100 - красный. Добавить проверку для поля ввода. Значение должно быть
// числом и должно входить в предел 0 - 100.